In [1]:
import pandas as pd

### print empty df

In [2]:
import pandas as pd

df=pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [3]:
nums=[[21,3,55,6,8,65,4],
      [291,3,55,56,8,65,4],
      [71,3,55,56,8,65,4]]

df2=pd.DataFrame(nums)
print(df2)

     0  1   2   3  4   5  6
0   21  3  55   6  8  65  4
1  291  3  55  56  8  65  4
2   71  3  55  56  8  65  4

# Series
### series is a 1-D array capable of storing data of any type

In [4]:
# Dictionary of days and dates
data = {'Monday': '2023-07-03',
        'Tuesday': '2023-07-04',
        'Wednesday': '2023-07-05',
        'Thursday': '2023-07-06',
        'Friday': '2023-07-07'}

# Create a Pandas Series from the dictionary
series = pd.Series(data)

# Print the resulting Series
print(series)

Monday       2023-07-03
Tuesday      2023-07-04
Wednesday    2023-07-05
Thursday     2023-07-06
Friday       2023-07-07
dtype: object

### create a series using data from Monday and Tuesday

In [5]:
# Dictionary of days and dates
data2 = {'Monday': '2023-07-03',
        'Tuesday': '2023-07-04'}

# Create a Pandas Series from the dictionary
series = pd.Series(data2)

# Print the resulting Series
print(series)

Monday     2023-07-03
Tuesday    2023-07-04
dtype: object

## Handling the mine dataset
Importation of the mine dataset.

In [6]:
mine=pd.read_csv('mine.csv')

#### head() method

In [7]:
mine.head()

   Duration  Pulse  Maxpulse  Calories
0        60    110       130     409.1
1        60    117       145     479.0
2        60    103       135     340.0
3        45    109       175     282.4
4        45    117       148     406.0

#### tail() method

In [8]:
mine.tail()

     Duration  Pulse  Maxpulse  Calories
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

#### info() method

In [9]:
mine.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

#### dropna() method

The dropna() method is used in Pandas to remove missing or null values from a Series or DataFrame. It returns a new Series or DataFrame with the missing values dropped.

Here's an example of how to use dropna() on a Pandas Series:

In [10]:
cleaned_mine = mine.dropna()

# Print the result
print(cleaned_mine)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[164 rows x 4 columns]

info() on cleaned_data

In [11]:
cleaned_mine.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 164 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  164 non-null    int64
 1   Pulse     164 non-null    int64
 2   Maxpulse  164 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 6.4 KB

#### fillna() method

In [12]:
# Fill the missing values with a specified value
filled_data = mine.fillna(0)

# Print the resulting filled Series
print(filled_data)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130     409.1
1          60    117       145     479.0
2          60    103       135     340.0
3          45    109       175     282.4
4          45    117       148     406.0
..        ...    ...       ...       ...
164        60    105       140     290.8
165        60    110       145     300.0
166        60    115       145     310.2
167        75    120       150     320.4
168        75    125       150     330.4

[169 rows x 4 columns]

info() on filled_data

In [13]:
filled_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 169 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  169 non-null    int64
 1   Pulse     169 non-null    int64
 2   Maxpulse  169 non-null    int64
 3   Calories  169 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 5.4 KB

In [14]:
mine.columns

Index(['Duration', 'Pulse', 'Maxpulse', 'Calories'], dtype='object')

## remove;
1. Wrong data

In [15]:
# Remove rows with wrong data (non-numeric values in the columns)
data = mine[pd.to_numeric(mine['Duration'], errors='coerce').notna()]
data = mine[pd.to_numeric(mine['Pulse'], errors='coerce').notna()]
data = mine[pd.to_numeric(mine['Maxpulse'], errors='coerce').notna()]
data = mine[pd.to_numeric(mine['Calories'], errors='coerce').notna()]

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 164 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  164 non-null    int64
 1   Pulse     164 non-null    int64
 2   Maxpulse  164 non-null    int64
 3   Calories  164 non-null    float64
dtypes: float64(1), int64(3)
memory usage: 6.4 KB

2. Wrong formats

In [17]:
# Convert column 'Calories' to int64 format
data['Calories'] = data['Calories'].astype(int)

# Print the resulting DataFrame with the converted column
print(data)

     Duration  Pulse  Maxpulse  Calories
0          60    110       130       409
1          60    117       145       479
2          60    103       135       340
3          45    109       175       282
4          45    117       148       406
..        ...    ...       ...       ...
164        60    105       140       290
165        60    110       145       300
166        60    115       145       310
167        75    120       150       320
168        75    125       150       330

[164 rows x 4 columns]

C:\Users\USER\AppData\Local\Temp\ipykernel_10364\2005377253.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data['Calories'] = data['Calories'].astype(int)

3. Duplicates

In [18]:
# Remove duplicate rows
data = data.drop_duplicates()
data.info()
data.shape  # reduced number of rows

<class 'pandas.core.frame.DataFrame'>
Int64Index: 154 entries, 0 to 168
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Duration  154 non-null    int64
 1   Pulse     154 non-null    int64
 2   Maxpulse  154 non-null    int64
 3   Calories  154 non-null    int32
dtypes: int32(1), int64(3)
memory usage: 5.4 KB

(154, 4)

4. Perform some correlation

In [19]:

# Perform correlation
correlation = data.corr()

# Print the resulting cleaned DataFrame and correlation matrix
print("Cleaned DataFrame:")
print(data)
print("\nCorrelation Matrix:")
print(correlation)

Cleaned DataFrame:
     Duration  Pulse  Maxpulse  Calories
0          60    110       130       409
1          60    117       145       479
2          60    103       135       340
3          45    109       175       282
4          45    117       148       406
..        ...    ...       ...       ...
164        60    105       140       290
165        60    110       145       300
166        60    115       145       310
167        75    120       150       320
168        75    125       150       330

[154 rows x 4 columns]

Correlation Matrix:
          Duration     Pulse  Maxpulse  Calories
Duration  1.000000 -0.161192  0.009329  0.925149
Pulse    -0.161192  1.000000  0.782996  0.018850
Maxpulse  0.009329  0.782996  1.000000  0.203124
Calories  0.925149  0.018850  0.203124  1.000000

# Handling the Work Dataset

In [20]:
work_df=pd.read_csv('Work.csv')
work_df

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

head()

In [21]:
work_df.head()

     Name         city  age py-score
0    Emma      Kampala   23       90
1  Wilber        Mbale   26       75
2   Robin         Gulu   25     mine
3   Tevor  Livingstone  NaN       89
4    Yeko       Tororo   20       94

tail()

In [22]:
work_df.tail()

     Name         city    age py-score
2   Robin         Gulu     25     mine
3   Tevor  Livingstone    NaN       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train      NaN
6   Jesca      Mbarara     21       84

info()

In [23]:
work_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      7 non-null      object
 1   city      7 non-null      object
 2   age       6 non-null      object
 3   py-score  6 non-null      object
dtypes: object(4)
memory usage: 352.0+ bytes

dropna()

In [24]:
dropped_workdf=work_df.dropna()
dropped_workdf.shape

(5, 4)

fillna()

In [25]:
filled_workdf=work_df.fillna(20)
filled_workdf

     Name         city    age py-score
0    Emma      Kampala     23       90
1  Wilber        Mbale     26       75
2   Robin         Gulu     25     mine
3   Tevor  Livingstone     20       89
4    Yeko       Tororo     20       94
5  Miriam         Arua  Train       20
6   Jesca      Mbarara     21       84

## remove;
1. Wrong data

In [26]:
# Remove rows with wrong data
data2=pd.read_csv('Work.csv')
data2 = data2[pd.to_numeric(data2['age'], errors='coerce').notna()]
data2 = data2[pd.to_numeric(data2['py-score'], errors='coerce').notna()]
data2

     Name     city age py-score
0    Emma  Kampala  23       90
1  Wilber    Mbale  26       75
4    Yeko   Tororo  20       94
6   Jesca  Mbarara  21       84

2. Wrong formats

In [27]:
# Convert columns to the correct format
data2['age'] = data2['age'].astype(int)
data2['py-score'] = pd.to_numeric(data2['py-score'])

data2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Name      4 non-null      object
 1   city      4 non-null      object
 2   age       4 non-null      int32
 3   py-score  4 non-null      int64
dtypes: int32(1), int64(1), object(2)
memory usage: 144.0+ bytes

3. Duplicates

Remove duplicates

In [28]:
data2 = data2.drop_duplicates()
data2

     Name     city  age  py-score
0    Emma  Kampala   23        90
1  Wilber    Mbale   26        75
4    Yeko   Tororo   20        94
6   Jesca  Mbarara   21        84

4. Perform some correlation

In [29]:
# Perform correlation
correlation = data2.corr()

# Print the resulting cleaned DataFrame and correlation matrix
print("Cleaned DataFrame:")
print(data2)
print("\nCorrelation Matrix:")
print(correlation)

Cleaned DataFrame:
     Name     city  age  py-score
0    Emma  Kampala   23        90
1  Wilber    Mbale   26        75
4    Yeko   Tororo   20        94
6   Jesca  Mbarara   21        84

Correlation Matrix:
               age  py-score
age       1.000000 -0.815891
py-score -0.815891  1.000000

C:\Users\USER\AppData\Local\Temp\ipykernel_10364\3326018350.py:2: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  correlation = data2.corr()